[
    {"name":"Guru","text":"Hey there, adventurer! I've got a stack of knowledge to share with you today. Ready to dive into the world of STACKs?"},
    {"name":"Guru","text":"Haha, your GURU reporting for duty! Alright, imagine a STACK like a big pile of pancakes."},
    {"name":"Guru","text":"You can only add or remove a pancake from the TOP. We call it a LAST IN, FIRST OUT structure. Hungry yet?"},
    {"name":"Guru","text":"TOP pointer points to where the topmost pancake is, so always keep track of it."},
    {"name":"Guru","text":"Let's say we've got a stack with pancakes labeled 1, 2, and 3. If we add pancake 4, it's gonna be the new star at the top."},
    {"name":"Guru","text":"We call adding a pancake PUSHing. So, go ahead and PUSH a pancake onto the stack using the button."},
    {"name":"Guru","text":"This is the algorithm for PUSH...."},
    {"name":"Guru","text":"We first check for OVERFLOW. Overflow signifies that the stack cannot accommodate any additional elements, similar to pouring water into a glass already filled to the brim."},
    {"name":"Guru","text":"Then we increment top and add the value to the stack."},
    {"name":"Guru","text":"Now think about a situation where you want to take a pancake from this stack."},
    {"name":"Guru","text":"Since it's LAST IN-FIRST OUT, you'll devour pancake number 5 before getting to the others. The one at TOP first!"},
    {"name":"Guru","text":"Removing an item from the stack is called POP. Now POP the topmost pancake from the stack using the POP button."},
    {"name":"Guru","text":"Here, we have to check if there are any pancakes left before trying to POP. If not, it can cause an UNDERFLOW."},
    {"name":"Guru","text":"Now keeping that in mind, choose the correct algorithm for POP from these two options:"},
    {"name":"Guru","text":"UNDERFLOW condition occurs when we try to POP from a stack that is already empty. It's like trying to eat a pancake when ther are none left :("},
    {"name":"Guru","text":"After checking for UNDERFLOW, we can get the value at TOP currently and then decrement TOP."},
    {"name":"Guru","text":"These are the two most important algorithms you need to know to deal with stacks."},
    {"name":"Guru","text":"Good Luck adventurer"}
]